[
  {
    "name": "StrataGen - Enhancement in FRACPRO.OPS Application",
    "desc": "Spearheaded the development of a comprehensive software solution for the Carboceramics industry, focusing on optimizing frac operations and enhancing data management. Utilized Java Spring Boot, Microservices architecture, and MongoDB. Managed deployment and continuous integration using Jenkins, adhering to Agile methodologies.",
    "image": "fracproops",
    "category": "Web-Application",
    "links": {
      "view": "#",
      "code": "#"
    }
  },
  {
    "name": "Datahub Project",
    "desc": "Contributed to the development of Datahub, a data management and integration platform designed for real-time data processing and synchronization. Integrated multiple data sources and ensured data consistency and availability using Java 21, PostgreSQL, Kafka, Debezium, Redis, and Eureka.",
    "image": "datahub",
    "category": "Web-Application",
    "links": {
      "view": "#",
      "code": "#"
    }
  },
  {
    "name": "Loan Management System (LMS) for Vitarma.in",
    "desc": "Developed a comprehensive Loan Management System for Vitarma.in to manage loan application processing, approval workflows, disbursement, and repayment tracking. Integrated with other financial modules for seamless operation.",
    "image": "financialweb",
    "category": "Web-Application",
    "links": {
      "view": "#",
      "code": "#"
    }
  },
  {
    "name": "Banking and Loan Management (JanSamriddhi.in)",
    "desc": "Developed a comprehensive platform for managing banking operations and loan management processes, including account management, transaction processing, and loan tracking. Integrated Angular for frontend and Java Spring Boot for backend services.",
    "image": "bankingloanmanagement",
    "category": "Web-Application",
    "links": {
      "view": "#",
      "code": "#"
    }
  },
  {
    "name": "Inventory Management System",
    "desc": "Developed a Java-based application for managing inventory, tracking stock levels, handling orders, and generating reports to improve inventory accuracy and streamline order processing.",
    "image": "inventorymanagement",
    "category": "Web-Application",
    "links": {
      "view": "#",
      "code": "#"
    }
  },
  {
    "name": "Customer Feedback System",
    "desc": "Designed and implemented a customer feedback system to collect, analyze, and act on customer feedback. Used Java and Hibernate for data management and reporting.",
    "image": "customerfeedback",
    "category": "Web-Application",
    "links": {
      "view": "#",
      "code": "#"
    }
  },
  {
    "name": "All-in-One Hotel Management System",
    "desc": "Developed a robust web application to streamline hotel operations, including room bookings, cab and bike rentals, and food orders. Built using Angular for the frontend and Java Spring Boot for backend services.",
    "image": "hotelmanagement",
    "category": "Web-Application",
    "links": {
      "view": "#",
      "code": "#"
    }
  },
  {
    "name": "Student Online Registration",
    "desc": "Developed a comprehensive Student Online Registration system using Python and Django, following the MVT design pattern. Implemented dynamic views and CRUD functionality for managing student registrations.",
    "image": "studentregistration",
    "category": "Web-Application",
    "links": {
      "view": "#",
      "code": "#"
    }
  },
  {
    "name": "Sale House Price Prediction",
    "desc": "Created a web application for predicting house prices using machine learning algorithms. Built with Python and libraries like Pandas and Matplotlib for data manipulation and visualization.",
    "image": "priceprediction",
    "category": "Web-Application",
    "links": {
      "view": "#",
      "code": "#"
    }
  },
  {
    "name": "Portfolio Website",
    "desc": "Personal Portfolio Website showcasing professional experience, projects, and skills.",
    "image": "portfolio1",
    "category": "Basic Web",
    "links": {
      "view": "#",
      "code": "#"
    }
  },
  {
    "name": "ResumeGen",
    "desc": "A ReactJS-based resume generator that allows users to create customized resumes quickly based on their requirements.",
    "image": "resumegen",
    "category": "MERN",
    "links": {
      "view": "#",
      "code": "#"
    }
  },
  {
    "name": "Foodicious",
    "desc": "Basic food website landing page built using HTML, CSS, and JavaScript.",
    "image": "foodicious",
    "category": "Basic Web",
    "links": {
      "view": "#",
      "code": "#"
    }
  },
  {
    "name": "Food Website",
    "desc": "Basic food website landing page developed using HTML, CSS, SASS, Bootstrap, and jQuery.",
    "image": "foodwebsite",
    "category": "Basic Web",
    "links": {
      "view": "#",
      "code": "#"
    }
  },
  {
    "name": "Basic Banking App",
    "desc": "Android app that uses SQLite to store user account data and provides features for basic transactions.",
    "image": "basicbank",
    "category": "Android",
    "links": {
      "view": "#",
      "code": "#"
    }
  },
  {
    "name": "Indian Temples",
    "desc": "Displays temples from different regions of India. Clicking on a temple redirects to its Wikipedia page for more information.",
    "image": "templeweb",
    "category": "Basic Web",
    "links": {
      "view": "#",
      "code": "#"
    }
  }
]
